tap "felixkratz/formulae"
tap "homebrew/autoupdate"
tap "jetbrains/utils"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
brew "ca-certificates"
brew "openssl@3"
brew "arduino-cli"
brew "bison"
brew "blueutil"
brew "boost"
brew "gettext"
brew "glib"
brew "cask"
brew "ccache"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "codex"
brew "composer"
brew "cpanminus"
brew "dbus"
brew "exercism"
brew "exiftool"
brew "expat"
brew "extra-cmake-modules"
brew "fastlane"
brew "flex"
brew "fortune"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "jq"
brew "libffi"
brew "libxml2"
brew "python@3.13"
brew "llvm"
brew "mariadb"
brew "mas"
brew "ninja"
brew "meson"
brew "neofetch"
brew "nmap"
brew "node"
brew "openjdk"
brew "perl"
brew "pipx"
brew "pkgconf", link: false
brew "pv"
brew "python@3.12"
brew "rbenv"
brew "rust"
brew "shellcheck"
brew "sl"
brew "subversion"
brew "swift-format"
brew "vulkan-headers"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "kde-mac/kde/grantlee-qt5"
cask "android-platform-tools"
cask "balenaetcher"
cask "bambu-studio"
cask "blender"
cask "busycal"
cask "chatgpt"
cask "coderunner"
cask "coteditor"
cask "cursor"
cask "diffusionbee"
cask "disk-drill"
cask "figma"
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-meslo-for-powerlevel10k"
cask "font-pretendard"
cask "font-sf-mono"
cask "font-sf-pro"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "mission-control-plus"
cask "netnewswire"
cask "obs"
cask "pixelsnap"
cask "popclip"
cask "sf-symbols"
cask "virtualbox"
mas "Actions", id: 1586435171
mas "Ad Block One", id: 1491889901
mas "Adblock Plus", id: 1432731683
mas "Affinity Designer 2", id: 1616831348
mas "Color Picker", id: 1545870783
mas "DaisyDisk", id: 411643860
mas "Day Progress", id: 6450280202
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "GeoGebra Calculator Suite", id: 1504416652
mas "Hancom Office HWP Viewer", id: 416746898
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MacDroid", id: 1476545828
mas "Magnet", id: 441258766
mas "Motion", id: 434290957
mas "Noir", id: 1592917505
mas "Offline Translate", id: 6686403979
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Right Click", id: 1364038646
mas "RunCat", id: 1429033973
mas "ScanTexter", id: 1635954549
mas "Scrivener", id: 1310686187
mas "Sitely", id: 863015334
mas "SnippetsLab", id: 1006087419
mas "TestFlight", id: 899247664
mas "Time Sink", id: 404363161
mas "Unicorn HTTPS", id: 1475628500
mas "UpNote", id: 1398373917
mas "Wappalyzer - Technology profiler", id: 1520333300
mas "Webull Desktop", id: 1334590352
vscode "akamud.vscode-theme-onedark"
vscode "github.github-vscode-theme"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
